* Notes
** when starting emacs
   ido mode
   erc fill mode
   set black

** end-of-file
    = ctrl-d

** Emacs keybindings

-c = compile
-o = link
-clear buffers c-x 1
-save  c-x c-s
-split vertical c-x 3
-split horizontal c-x 2
-directory c-x c-d
-compiling c-c c
-shell M-x shell
-change buffers c-x b
-close buffer c-x k
-exit emacs c-x c-c
-undo c-x u
-search: c-s
-copy: select with arrows the m-w
-paste: m-y
-delete line: c-k
-clock in: c-c c-x c-i
-clock out: c-c c-x c-o
-update clock grid c-c c-c
--not emacs -- highlight, then middleclick to paste highlighted content

* Tasks

#+begin: clocktable :maxlevel 3 :scope subtree :indent nil :emphasize nil :scope file :narrow 75 :formula %
#+CAPTION: Clock summary at [2018-01-23 Tue 14:37]
| <75>                                                                        |         |      |   |       |
| Headline                                                                    | Time    |      |   |     % |
|-----------------------------------------------------------------------------+---------+------+---+-------|
| *Total time*                                                                | *57:19* |      |   | 100.0 |
|-----------------------------------------------------------------------------+---------+------+---+-------|
| Tasks                                                                       | 57:19   |      |   | 100.0 |
| Setup CMake                                                                 |         | 0:44 |   |   1.3 |
| frame name program 1                                                        |         | 0:20 |   |   0.6 |
| frame loop program                                                          |         | 0:37 |   |   1.1 |
| grade task                                                                  |         | 2:32 |   |   4.4 |
| build boost                                                                 |         | 1:03 |   |   1.8 |
| chapter 4                                                                   |         | 1:05 |   |   1.9 |
| building boost and witty again                                              |         | 0:14 |   |   0.4 |
| witty hello                                                                 |         | 1:52 |   |   3.3 |
| witty add                                                                   |         | 2:37 |   |   4.6 |
| video guides                                                                |         | 0:56 |   |   1.6 |
| helping PG with addwt                                                       |         | 0:15 |   |   0.4 |
| learn cpp chapter 0 - 1.4a                                                  |         | 2:11 |   |   3.8 |
| learn cpp chapter 1.4 - 1.7                                                 |         | 0:30 |   |   0.9 |
| learn cpp chapter 1.7-end                                                   |         | 2:05 |   |   3.6 |
| make 21 game                                                                |         | 4:51 |   |   8.5 |
| learncpp chapter 2                                                          |         | 1:57 |   |   3.4 |
| shop checkout program                                                       |         | 1:53 |   |   3.3 |
| learncpp chapter 3                                                          |         | 3:13 |   |   5.6 |
| text rpg game                                                               |         | 4:51 |   |   8.5 |
| tictactoe                                                                   |         | 4:26 |   |   7.7 |
| learncpp chapter 4                                                          |         | 1:38 |   |   2.8 |
| pyramids                                                                    |         | 2:57 |   |   5.1 |
| learncpp chapter 5                                                          |         | 1:38 |   |   2.8 |
| barchart                                                                    |         | 3:41 |   |   6.4 |
| textrpg 2                                                                   |         | 1:21 |   |   2.4 |
| textrpg 2 cnt                                                               |         | 3:28 |   |   6.0 |
| textrpg 2 cnt2                                                              |         | 3:55 |   |   6.8 |
| research arrays                                                             |         | 0:29 |   |   0.8 |
#+TBLFM: $5='(org-clock-time% @3$2 $2..$4);%.1f
#+end

** Setup CMake
   CLOCK: [2018-01-04 Thu 13:31]--[2018-01-04 Thu 14:15] =>  0:44

- link to tutorial: http://derekmolloy.ie/hello-world-introductions-to-cmake/

** frame name program 1
   CLOCK: [2018-01-05 Fri 13:30]--[2018-01-05 Fri 13:50] =>  0:20
   chapter 1 in book
   project1 file

** frame loop program
   CLOCK: [2018-01-08 Mon 9:30]--[2018-01-08 Mon 10:07] =>  0:37
   chapter 2 in book
   project2 file
** grade task
   CLOCK: [2018-01-08 Mon 11:30]--[2018-01-08 Mon 14:02] =>  2:32
   chapter 3 in book
   gradeproj file
  Set precision:
  Sets the precision to be used by output operations as by a call to stream's member precision(n)
  The precision determines the maximum number of digits that shall be output on insertion operations to express floating-point values, counting both the digits before and after the decimal point.
  You must include <iomanip> to use this manipulator.

** build boost
   CLOCK: [2018-01-08 Mon 13:00]--[2018-01-08 Mon 14:03] =>  1:03

1. copy files from green USB key for boost and wt. copy them into ~/Development.
2. unpack boost:

tar -xaf boost_1_66_0.tar.bz2

3. build boost:

cd boost_1_66_0/
./bootstrap.sh
./b2 --prefix=/home/marco/local
./b2 --prefix=/home/marco/local --install

replace "marco" with your username, here and on all other commands below.

4. when boost is finished, you can start with witty. unpack witty:

tar -xaf witty-4.0.2.tar.gz

5. build witty:

cd wt-4.0.2
export CMAKE_INCLUDE_PATH=/home/marco/local/include
export CMAKE_LIBRARY_PATH=/home/marco/local/lib
mkdir build
cd build
cmake ..
make -j 4
make install

6. create a new project, and add the following to the CMake file (in
addition to what you normally add) add the following:

6.1 after the project:

find_package(Wt REQUIRED)

6.2 after the target (e.g. the line with target_link_libraries):

target_link_libraries(PROJECT ${Wt_LIBRARIES})

7. manually copy the contents of this file:

https://www.webtoolkit.eu/wt/src/hello

8. build and run it. you need to run it with the following parameters:

./PROJECT  --docroot . --http-address 0.0.0.0 --http-port 8080

9. go to chrome and type:

http://localhost:8080

if all goes well you should see the hello world.

** chapter 4
   CLOCK: [2018-01-09 Tue 09:56]--[2018-01-09 Tue 11:01] =>  1:05
** building boost and witty again
   CLOCK: [2018-01-09 Tue 11:01]--[2018-01-09 Tue 11:15] =>  0:14
** witty hello
   CLOCK: [2018-01-09 Tue 13:30]--[2018-01-09 Tue 14:44] =>  1:14
   CLOCK: [2018-01-09 Tue 11:16]--[2018-01-09 Tue 11:54] =>  0:38
   Changed text, changed button margin, added fullstop after response ( + ".")

compile:
cd /home/niam/Development/myproject/hellowt2/build && CMAKE_INCLUDE_PATH=/home/niam/local/include CMAKE_LIBRARY_PATH=/home/niam/local/lib cmake .. && make

  to run ./hello --docroot . --http-listen 0.0.0.0:8080/


** witty add
   CLOCK: [2018-01-10 Wed 09:13]--[2018-01-10 Wed 10:17] =>  1:04
   CLOCK: [2018-01-09 Tue 20:12]--[2018-01-09 Tue 20:47] =>  0:35
   CLOCK: [2018-01-09 Tue 15:00]--[2018-01-09 Tue 15:58] =>  0:58
"stoi changes string to int, to_string converts int to string"
** video guides
   CLOCK: [2018-01-10 Wed 10:40]--[2018-01-10 Wed 11:36] =>  0:56
email:
C++
https://www.youtube.com/watch?v=b5c2M0gVlgk
https://www.youtube.com/watch?v=YzWLdGGD3-E
Emacs:
https://www.youtube.com/watch?v=16Rd46SE-20&list=PL7F907999BA1994A1
-also check yt for other good videos
** helping PG with addwt
   CLOCK: [2018-01-11 Thu 11:40]--[2018-01-11 Thu 11:55] =>  0:15

** learn cpp chapter 0 - 1.4a
   CLOCK: [2018-01-11 Thu 11:56]--[2018-01-11 Thu 13:02] =>  1:06
   CLOCK: [2018-01-11 Thu 10:35]--[2018-01-11 Thu 11:40] =>  1:05
   www.learncpp.com
   project files: hello, double number
*** notes
int x - is a declaration statement
x = 5 - is an assignment statement
std::cout << x; - is an output statement
2 + 3 - is an expression (a mathematical entity that evaluates a value)
assignment:
int x;
x = 5;
initialization:
int x = 5;
std::cin and cout always go on the left-hand side of the statement.
std::cout is used to output a value (cout = character output) <<
std::cin is used to get an input value (cin = character input) >>
** learn cpp chapter 1.4 - 1.7
   CLOCK: [2018-01-11 Thu 13:15]--[2018-01-11 Thu 13:45] => 0:30
** learn cpp chapter 1.7-end
   CLOCK: [2018-01-12 Fri 10:00]--[2018-01-12 Fri 10:20] =>  0:20
   CLOCK: [2018-01-11 Thu 14:30]--[2018-01-11 Thu 16:15] =>  1:45
   made calculator - project file in learncpp
** make 21 game
   CLOCK: [2018-01-12 Fri 13:30]--[2018-01-12 Fri 16:59] =>  3:29
   CLOCK: [2018-01-12 Fri 11:06]--[2018-01-12 Fri 12:17] =>  1:11
   CLOCK: [2018-01-12 Fri 10:37]--[2018-01-12 Fri 10:48] =>  0:11
*** notes
do{
statement
}while (...);

srand((unsigned)time(0)); -- make rand unpredictable
(rand() % 11) + 1; --- rand num between 1 and 11.

** learncpp chapter 2
   CLOCK: [2018-01-15 Mon 10:16]--[2018-01-15 Mon 11:55] =>  1:39
   CLOCK: [2018-01-12 Fri 10:48]--[2018-01-12 Fri 11:06] =>  0:18
** shop checkout program
   CLOCK: [2018-01-15 Mon 13:30]--[2018-01-15 Mon 14:30] =>  1:00
   CLOCK: [2018-01-15 Mon 12:07]--[2018-01-15 Mon 13:00] =>  0:53
*** notes
better solution - https://www.youtube.com/watch?v=0Q0LRCH98fw
** learncpp chapter 3
   CLOCK: [2018-01-17 Wed 9:30]--[2018-01-17 Wed 11:42] =>  2:12
   CLOCK: [2018-01-15 Mon 14:40]--[2018-01-15 Mon 15:41] =>  1:01
*** notes
static cast<double>x to convert integer division to float.
int x = 5;
int y = ++x; // x is now equal to 6, and 6 is assigned to y
int x = 5;
int y = x++; // 5 is assigned to y, and x is now equal to 6

** text rpg game
   CLOCK: [2018-01-16 Tue 14:10]--[2018-01-16 Tue 15:36] =>  1:26
   CLOCK: [2018-01-16 Tue 12:30]--[2018-01-16 Tue 14:04] =>  1:34
   CLOCK: [2018-01-16 Tue 10:00]--[2018-01-16 Tue 11:51] =>  1:51

*** notes
class classname {
public:
    int var;
    int var;
    int var;
};

in main -- classname.var = 12..

exit(0); - terminate program.

** tictactoe
   CLOCK: [2018-01-17 Wed 14:15]--[2018-01-17 Wed 16:30] => 2:15
   CLOCK: [2018-01-17 Wed 13:00]--[2018-01-17 Wed 14:11] =>  1:11
   CLOCK: [2018-01-17 Wed 11:30]--[2018-01-17 Wed 12:30] => 1:00
** learncpp chapter 4
   CLOCK: [2018-01-18 Thu 10:22]--[2018-01-18 Thu 11:00] => 1:38
   CLOCK: [2018-01-18 Thu 9:00]--[2018-01-18 Thu 10:00] =>  1:00
** pyramids
   CLOCK: [2018-01-18 Thu 13:00]--[2018-01-18 Thu 15:57] =>  2:57
** learncpp chapter 5
   CLOCK: [2018-01-19 Fri 16:00]--[2018-01-19 Fri 17:] => 1:00
   CLOCK: [2018-01-19 Fri 9:00]--[2018-01-19 Fri 10:38] =>  1:38
** barchart
   CLOCK: [2018-01-19 Fri 14:40]--[2018-01-19 Fri 16:00] => 1:20
   CLOCK: [2018-01-19 Fri 14:00]--[2018-01-19 Fri 14:30] =>  0:30
   CLOCK: [2018-01-19 Fri 10:39]--[2018-01-19 Fri 12:30] => 1:51
** textrpg 2
   CLOCK: [2018-01-22 Mon 10:28]--[2018-01-22 Mon 11:49] =>  1:21
   -- turned mission 1 into a function called tutorial
   -- started a new part to the game ---- discuss objectives
** textrpg 2 cnt
   CLOCK: [2018-01-22 Mon 16:45]--[2018-01-22 Mon 17:00] =>  0:15
   CLOCK: [2018-01-22 Mon 16:16]--[2018-01-22 Mon 16:40] =>  0:24
   CLOCK: [2018-01-22 Mon 15:50]--[2018-01-22 Mon 16:15] =>  0:25
   CLOCK: [2018-01-22 Mon 14:20]--[2018-01-22 Mon 15:44] =>  1:24
   CLOCK: [2018-01-22 Mon 12:50]--[2018-01-22 Mon 13:13] =>  0:23
   CLOCK: [2018-01-22 Mon 12:13]--[2018-01-22 Mon 12:50] =>  0:37
   --1 -- set class, set variables, loop to allocate points to variables
   --2 -- intro
   --3 -- first choice, battle system
   --4 -- compare code
   --5 -- level up system
   --6 -- compare code
** textrpg 2 cnt2
   CLOCK: [2018-01-23 Tue 13:30]--[2018-01-23 Tue 14:36] =>  1:06
   CLOCK: [2018-01-23 Tue 11:58]--[2018-01-23 Tue 12:26] =>  0:28
   CLOCK: [2018-01-23 Tue 11:00]--[2018-01-23 Tue 11:24] =>  0:24
   CLOCK: [2018-01-23 Tue 09:51]--[2018-01-23 Tue 10:57] =>  1:06
   CLOCK: [2018-01-23 Tue 09:00]--[2018-01-23 Tue 09:51] =>  0:51
   --1 --Tried to change code into seperate functions.
   --2 --Expanded game.
   --3 --Comparing code, discussing task.
   --4 --Implementing array.
   --5 --Implement 21 game into rpg, (move return into playGame false).
** research arrays
   CLOCK: [2018-01-23 Tue 11:28]--[2018-01-23 Tue 11:57] =>  0:29
